In [3]:
#Title
#This is source

# Title

-
-
-

-
-

-
-

In [7]:
import IPython

In [8]:
print(IPython.sys_info())

{'commit_hash': '5c9c918',
 'commit_source': 'installation',
 'default_encoding': 'cp1252',
 'ipython_path': 'C:\\Users\\Admin\\Anaconda3\\lib\\site-packages\\IPython',
 'ipython_version': '5.1.0',
 'os_name': 'nt',
 'platform': 'Windows-7-6.1.7601-SP1',
 'sys_executable': 'C:\\Users\\Admin\\Anaconda3\\python.exe',
 'sys_platform': 'win32',
 'sys_version': '3.5.2 |Anaconda 4.2.0 (64-bit)| (default, Jul  5 2016, '
                '11:41:13) [MSC v.1900 64 bit (AMD64)]'}

In [9]:
import pandas as pd

In [10]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/datasets/Titanic.csv')

In [11]:
titanic.head()

,Unnamed: 0,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [12]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 7 columns):
Unnamed: 0    1313 non-null int64
Name          1313 non-null object
PClass        1313 non-null object
Age           756 non-null float64
Sex           1313 non-null object
Survived      1313 non-null int64
SexCode       1313 non-null int64
dtypes: float64(1), int64(3), object(3)
memory usage: 71.9+ KB

In [13]:
del titanic['Unnamed: 0']

In [14]:
titanic.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [16]:
titanic[['PClass','Age','SexCode']].head()

  PClass    Age  SexCode
0    1st  29.00        1
1    1st   2.00        1
2    1st  30.00        0
3    1st  25.00        1
4    1st   0.92        0

In [18]:
titanic.Age.head()

0    29.00
1     2.00
2    30.00
3    25.00
4     0.92
Name: Age, dtype: float64

In [19]:
tpy=titanic.values

In [20]:
tpy

array([['Allen, Miss Elisabeth Walton', '1st', 29.0, 'female', 1, 1],
       ['Allison, Miss Helen Loraine', '1st', 2.0, 'female', 0, 1],
       ['Allison, Mr Hudson Joshua Creighton', '1st', 30.0, 'male', 0, 0],
       ...,
       ['Zenni, Mr Philip', '3rd', 22.0, 'male', 0, 0],
       ['Lievens, Mr Rene', '3rd', 24.0, 'male', 0, 0],
       ['Zimmerman, Leo', '3rd', 29.0, 'male', 0, 0]], dtype=object)

In [21]:
import os as os

In [22]:
os.getcwd()

'C:\\Users\\Admin\\Documents'

In [25]:
os.chdir('F:\STUDY\Digital_Vidya\Data Analytics\Python-3')

In [24]:
os.getcwd()

'C:\\Users\\Admin\\Documents'

In [26]:
os.getcwd()

'F:\\STUDY\\Digital_Vidya\\Data Analytics\\Python-3'

In [27]:
os.listdir()

['Dataset.txt', 'Titanic.csv']

In [28]:
titanic.to_csv('F:\\STUDY\\Digital_Vidya\\Data Analytics\\Python-3\\titanic2.csv', index=False)

In [29]:
os.listdir()

['Dataset.txt', 'Titanic.csv', 'titanic2.csv']

In [31]:
titanic.query("PClass=='1st'" and "Survived == 1 ")

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.00,female,1,1
11,"Astor, Mrs John Jacob (Madeleine Talmadge Force)",1st,19.00,female,1,1
12,"Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1
13,"Barkworth, Mr Algernon H",1st,NaN,male,1,0
15,"Baxter, Mrs James (Helene DeLaudeniere Chaput)",1st,50.00,female,1,1
18,"Beckwith, Mr Richard Leonard",1st,37.00,male,1,0
19,"Beckwith, Mrs Richard Leonard (Sallie Monypeny)",1st,47.00,female,1,1
20,"Behr, Mr Karl Howell",1st,26.00,male,1,0
22,"Bishop, Mr Dickinson H",1st,25.00,male,1,0
23,"Bishop, Mrs Dickinson H (Helen Walton)",1st,19.00,female,1,1
24,"Bjornstrm-Steffansson, Mr Mauritz Hakan",1st,28.00,male,1,0
26,"Blank, Mr Henry",1st,39.00,male,1,0
27,"Bonnell, Miss Caroline",1st,30.00,female,1,1
28,"Bonnell, Miss Elizabeth",1st,58.00,female,1,1
30,"Bowen, Miss Grace Scott",1st,45.00,female,1,1
31,"Bowerman, Miss Elsie Edith",1st,22.00,female,1,1
32,"Bradley, Mr George",1st,NaN,male,1,0
36,"Brown, Mrs James Joseph (Margaret Molly"" Tobin)""",1st,44.00,female,1,1
37,"Brown, Mrs John Murray (Caroline Lane Lamson)",1st,59.00,female,1,1
38,"Bucknell, Mrs William Robert (Emma Eliza Ward)",1st,60.00,female,1,1
40,"Calderhead, Mr Edward P",1st,NaN,male,1,0
41,"Candee, Mrs Edward (Helen Churchill Hungerford)",1st,53.00,female,1,1
42,"Cardeza, Mrs James Warburton Martinez (Charlot...",1st,58.00,female,1,1
43,"Cardeza, Mr Thomas Drake Martinez",1st,36.00,male,1,0
47,"Carter, Mr William Ernest",1st,36.00,male,1,0
48,"Carter, Mrs William Ernest (Lucile Polk)",1st,36.00,female,1,1
...,...,...,...,...,...,...
1098,"Osman, Miss Maria",3rd,NaN,female,1,1
1122,"Pekoniemi, Mr Edvard",3rd,NaN,male,1,0
1125,"Persson, Mr Ernst Ulrik",3rd,NaN,male,1,0
1136,"Pickard (Trembisky), Mr Berk",3rd,NaN,male,1,0
1151,"Riordan, Miss Hannah",3rd,NaN,female,1,1
1161,"Roth, Miss Sarah",3rd,NaN,female,1,1
1164,"Ryan, Mr Edward Ryan",3rd,NaN,male,1,0
1167,"Saad, Khalil",3rd,NaN,male,1,0
1182,"Salkjelsvik, Miss Anna",3rd,NaN,female,1,1
1187,"Sandstrom, Miss Hjalmar",3rd,NaN,female,1,1
1199,"Sheerlinck, Mr Jean",3rd,NaN,male,1,0
1201,"Shine, Miss Ellen",3rd,NaN,female,1,1
1207,"Sjoblom, Miss Anna Sofia",3rd,NaN,female,1,1
1219,"Smyth, Miss Julia",3rd,NaN,female,1,1
1222,"Sop, Mr Jules",3rd,NaN,male,1,0
1226,"Stanley, Miss Amy Zilla Elsie",3rd,NaN,female,1,1
1231,"Stranden, Mr Juho",3rd,NaN,male,1,0
1235,"Sunderland, Mr Victor Francis",3rd,NaN,male,1,0
1239,"Svensson, Mr Johan Cervin",3rd,NaN,male,1,0
1242,"Tenglin, Mr Gunnar Isidor",3rd,NaN,male,1,0
1244,"Thomas, Mrs Alexander",3rd,NaN,female,1,1
1251,"Thorneycroft, Mrs Percival",3rd,NaN,female,1,1
1258,"Tornquist, Mr William Henry",3rd,25.00,male,1,0
1263,"Turja, Miss Anna Sofia",3rd,18.00,female,1,1
1264,"Turkula, Mrs Hedvig",3rd,63.00,female,1,1
1279,"Vartunian, Mr David",3rd,22.00,male,1,0
1289,"Wennerstrom, Mr August Edvard",3rd,NaN,male,1,0
1293,"Wilkes, Mrs Ellen",3rd,45.00,female,1,1
1302,"Yalsevac, Mr Ivan",3rd,NaN,male,1,0
1304,"Yasbeck, Mrs Antoni",3rd,15.00,female,1,1

In [36]:
titanic.query("PClass=='1st'" and "Survived == 1 ").count()

Name        450
PClass      450
Age         313
Sex         450
Survived    450
SexCode     450
dtype: int64

In [35]:
titanic.query("PClass=='3rd' and Survived == 1").count()

Name        138
PClass      138
Age          78
Sex         138
Survived    138
SexCode     138
dtype: int64

In [37]:
138/711

0.1940928270042194

In [40]:
pd.crosstab(titanic.PClass,titanic.Survived)

Survived    0    1
PClass
*           1    0
1st       129  193
2nd       160  119
3rd       573  138

In [42]:
pd.crosstab(titanic.PClass,titanic.Survived,normalize = 'index')

Survived         0         1
PClass
*         1.000000  0.000000
1st       0.400621  0.599379
2nd       0.573477  0.426523
3rd       0.805907  0.194093

In [50]:
titanic.query("PClass=='1st'" and "Sex == 'male' " and "Survived == 1").count()

Name        450
PClass      450
Age         313
Sex         450
Survived    450
SexCode     450
dtype: int64

In [51]:
titanic.query("PClass=='3rd'" and "Sex == 'male' " and "Survived == 1").count()

Name        450
PClass      450
Age         313
Sex         450
Survived    450
SexCode     450
dtype: int64

In [52]:
pd.crosstab([titanic.PClass, titanic.Sex], titanic.Survived, margins=True)

Survived         0    1   All
PClass Sex
*      male      1    0     1
1st    female    9  134   143
       male    120   59   179
2nd    female   13   94   107
       male    147   25   172
3rd    female  132   80   212
       male    441   58   499
All            863  450  1313

In [58]:
titanic.loc[titanic.Survived==1,'Survived2=']='Alive'

In [59]:
titanic.head()

,Name,PClass,Age,Sex,Survived,SexCode,Survived2=,Survived2
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1,Alive,Alive
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1,NaN,NaN
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0,NaN,NaN
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1,NaN,NaN
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0,Alive,Alive

In [60]:
titanic.loc[titanic.Survived!=1,'Survived2']='Dead'

In [61]:
titanic.head()

,Name,PClass,Age,Sex,Survived,SexCode,Survived2=,Survived2
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1,Alive,Alive
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1,NaN,Dead
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0,NaN,Dead
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1,NaN,Dead
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0,Alive,Alive